# RebarShapeDrivenAccessor Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeDrivenAccessor Properties
RebarShapeDrivenAccessor Class See Also
---
The RebarShapeDrivenAccessor type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ArrayLength | Identifies the distribution path length of rebar set. |
| BarsOnNormalSide | Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal. |
| BaseFinishingTurns | For a spiral, the number of finishing turns at the lower end of the spiral. |
| Height | For a spiral, the overall height. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| MultiplanarDepth | For a multiplanar rebar, the depth of the instance. |
| Normal | A unit-length vector normal to the plane of the rebar |
| Pitch | For a spiral, the pitch, or vertical distance traveled in one rotation. |
| TopFinishingTurns | For a spiral, the number of finishing turns at the upper end of the spiral. |

# See Also
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace